mixbag/app/views/bags/show.html.erb

<%= content_tag :ul do %>
	<% @bag.items.each do |item| %>
---
SELECT "items".* FROM "items"  WHERE "items"."bag_id" = ?  [["bag_id", 9]]

<%= form_tag({ controller: :bags, action: :generate}, id: @bag, method: :get ) do %>
	<%= range_field_tag :nbr, 1, min: 1, max: @bag.items.count, step: 1 %>
---
SELECT COUNT(*) FROM "items"  WHERE "items"."bag_id" = ?  [["bag_id", 9]]